ka2_2024/src/Enums/СервисыОбменаСБанками/СервисыОбменаСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СервисыОбменаСБанками</name>
  <enumValues>
    <name>ФинансоваяОтчетность</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиНаКредит</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиНаЛизинг</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиНаОткрытиеСчета</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>АПК:413 История выбора важна для отв.лиц. Из-за наличия ОбработкаПолученияДанныхВыбора должна отключаться в потребителях</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетНаучныеТруды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетИзобретения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаПриНачисленииПособий</name>
    <type>
      <types>EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКОсобойЗоне</name>
    <type>
      <types>EnumRef.ОтношениеКОсобойЗоне</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсобойЗоны</name>
    <type>
      <types>EnumRef.ВидыОсобойЗоныПроживанияРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостоянноПроживалВКрыму18Марта2014Года</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициалы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнициалыИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяФЗ_20_2023</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактПроживанияДНРЛНРЗОХО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактПроживанияДНРЛНР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактПроживанияЗОХО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСоставСемьи</name>
    <attributes>
      <name>СтепеньРодства</name>
      <type>
        <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьОбразование</name>
    <attributes>
      <name>ВидОбразования</name>
      <type>
        <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>УчебноеЗаведение</name>
      <type>
        <types>CatalogRef.УчебныеЗаведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
    <attributes>
      <name>Диплом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьЗнаниеЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.ЯзыкиНародовМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньЗнанияЯзыка</name>
      <type>
        <types>CatalogRef.СтепениЗнанияЯзыка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПрофессии</name>
    <attributes>
      <name>Профессия</name>
      <type>
        <types>CatalogRef.ПрофессииРабочих</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСтажи</name>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>CatalogRef.ВидыСтажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтсчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНаграды</name>
    <attributes>
      <name>Награда</name>
      <type>
        <types>CatalogRef.Награды</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПриказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧейПриказ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьУченыеСтепени</name>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>CatalogRef.УченыеСтепени</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрисужденияУченойСтепени</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтрасльНауки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиссертационныйСовет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДипломСерияНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДипломВыданОрганизация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьУченыеЗвания</name>
    <attributes>
      <name>УченоеЗвание</name>
      <type>
        <types>CatalogRef.УченыеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрисвоенияУченогоЗвания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АттестатСерия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АттестатНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АттестатВыданОрганизация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаучнаяСпециальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/CommonModules/ФинОтчетностьВБанкиКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру с ключами для проверки сертификата.
//
// Возвращаемое значение:
//	Структура - см. Результат.
//
Функция ПараметрыОтбораСертификата() Экспорт

	Результат = УниверсальныйОбменСБанкамиКлиентСервер.ПараметрыОтбораСертификата(
		ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность"), 
		ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
		
	// Вид заемщика.
	Результат.Вставить("ЮридическоеФизическоеЛицо", ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ПустаяСсылка"));
	// ИНН заемщика-юридического лица/ИП или ИНН представителя заемщика по доверенности.
	Результат.Вставить("ИНН", "");
	// Представитель заемщика по доверенности.
	Результат.Вставить("ФизическоеЛицо", ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"));
	// СНИЛС представителя заемщика по доверенности.
	Результат.Вставить("СНИЛС", "");
	
	Возврат Результат;

КонецФункции

// На основании заполненных ИНН и СНИЛС формирует представление отбора.
//
// Параметры:
//  ПараметрыОтбора - Структура - см. ПараметрыОтбораСертификата()
//  СубъектПредставление - Строка - имя субъекта, на основании которого накладываются отборы.
//
Процедура ЗаполнитьПредставлениеОтбораСертификата(ПараметрыОтбора, СубъектПредставление) Экспорт
	Перем Отбор1, Отбор2;
	
	Если ПустаяСтрока(ПараметрыОтбора.ИНН) Тогда
		Если ПустаяСтрока(ПараметрыОтбора.СНИЛС) Тогда
			ШаблонПредставленияОтбора = НСтр("ru = '%1 (без отборов)'");
		Иначе
			ШаблонПредставленияОтбора = НСтр("ru = '%1 (СНИЛС %2)'");
			Отбор1 = ПараметрыОтбора.СНИЛС;
		КонецЕсли;
	Иначе
		Отбор1 = ПараметрыОтбора.ИНН;
		Если ПустаяСтрока(ПараметрыОтбора.СНИЛС) Тогда
			ШаблонПредставленияОтбора = НСтр("ru = '%1 (ИНН %2)'");
		Иначе
			ШаблонПредставленияОтбора = НСтр("ru = '%1 (ИНН %2, СНИЛС %3)'");
			Отбор2 = ПараметрыОтбора.СНИЛС;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор2) Тогда
		ПараметрыОтбора.ПредставлениеОтбора = СтрШаблон(ШаблонПредставленияОтбора, СубъектПредставление, Отбор1, Отбор2);
	ИначеЕсли ЗначениеЗаполнено(Отбор1) Тогда
		ПараметрыОтбора.ПредставлениеОтбора = СтрШаблон(ШаблонПредставленияОтбора, СубъектПредставление, Отбор1);
	Иначе
		ПараметрыОтбора.ПредставлениеОтбора = СтрШаблон(ШаблонПредставленияОтбора, СубъектПредставление);
	КонецЕсли;
	
КонецПроцедуры

// Определяет, подходит ли сертификат для выполнения указанной операции для организации.
//
// Параметры:
//	Сертификат    - СертификатКриптографии - Сертификат, для которого выполняется проверка.
//	ПараметрыОтбора - Структура - см. ФинОтчетностьВБанкиКлиентСервер.ПараметрыОтбораСертификата().
//	Результат     - Структура - см. УниверсальныйОбменСБанкамиКлиентСервер.РезультатФункцийСоответствияОтбору().
//	
Процедура СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат) Экспорт

	ДанныеСубъекта = УниверсальныйОбменСБанкамиКлиентСервер.ДанныеСубъектаСертификата(Сертификат);
	
	УниверсальныйОбменСБанкамиКлиентСервер.СертификатСоответствуетОтборуПоИННиСНИЛС(ДанныеСубъекта, ПараметрыОтбора, Результат);

КонецПроцедуры

Функция ЭтоБанкУниверсальногоОбмена(Банк) Экспорт
	
	Возврат ЗначениеЗаполнено(Банк) И ТипЗнч(Банк) = Тип("СправочникСсылка.БанкиУниверсальногоОбмена");
	
КонецФункции

Функция СобытиеЖурналаРегистрации(ВариантСобытия = "") Экспорт
	
	ИмяСобытия = НСтр("ru = '1С:ФинОтчетность'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	Если Не ПустаяСтрока(ВариантСобытия) Тогда
		ИмяСобытия = ИмяСобытия + "." + ВариантСобытия;
	КонецЕсли;

	Возврат ИмяСобытия;
	
КонецФункции

Функция ИмяПараметраДатыПоследнегоОбмена() Экспорт
	
	Возврат "ДатаОбменаССервером";
	
КонецФункции

#Область СтатусыОтчета

Функция СтатусОшибка() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтатусыОтправкиФинОтчетностиВБанки.Ошибка");
	
КонецФункции

Функция СтатусДоставлено() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтатусыОтправкиФинОтчетностиВБанки.Доставлено");
	
КонецФункции

Функция СтатусОтклонено() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтатусыОтправкиФинОтчетностиВБанки.Отклонено");
	
КонецФункции

Функция СтатусОтправлено() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтатусыОтправкиФинОтчетностиВБанки.Отправлено");
	
КонецФункции

Функция СтатусСдано() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтатусыОтправкиФинОтчетностиВБанки.Сдано");
	
КонецФункции

Функция СтатусНеОтправлено() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтатусыОтправкиФинОтчетностиВБанки.НеОтправлено");
	
КонецФункции

Функция ГруппаЗавершенныеОтправки() Экспорт
	
	Возврат "ФинансоваяОтчетностьЗавершенныеОтправки";
	
КонецФункции

Функция ГруппаНеЗавершенныеОтправки() Экспорт
	
	Возврат "ФинансоваяОтчетностьНеЗавершенныеОтправки";
	
КонецФункции

Функция НовыеПараметрыОбработчикаОжиданияВходящихСообщений() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаПоследнегоПолученногоСообщения", Дата(1,1,1));
	Результат.Вставить("ПоказыватьФормуСоСтарымиСообщениями", Истина);
	Результат.Вставить("ЦикловОжиданияДоПоказаФормы", 1);
	Результат.Вставить("ЦикловОжиданияДоПоказаФормыНачальноеЗначение", 6);
	Результат.Вставить("Интервал", 5 * 60); // интервал вызова обработчика 5 минут.
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ИмяСобытияПометкаПредметаПрочтенным() Экспорт
	
	Возврат "ПометкаОтчетаВБанкПрочтенным";
	
КонецФункции

#КонецОбласти
